export const QUESTS = [
    {
        id: "q-hunt",
        difficulty: "medium",
        title: 'Уничтожение зверя',
        target: 'Разьярённая Урса',
        rewardImg: "images/quests/rewards/AK47.png",
        imgDescription: 'Несокрушимое оружие',
        modalTitle: 'Выследить и убить',
        description: `На окраине деревни Оукридж есть лес с небольшими скалами внутри. в
                        одной из них есть пещера, по виду которой сразу будет ясно, что она
                        занята опасным хищником. Конкретно этот зверь - Урса. Не смотря на
                        то, что она появилась в этом лесу не так давно, но уже начала весомо
                        терроризировать местных обитателей... по крайней мере тех, кто смог
                        сбежать. Будь уверен, что этот зверь не желает знать значения слова
                        "компромисс".`
    },

    {
        id: "q-find",
        difficulty: "medium",
        title: 'Поиск порталов',
        rewardImg: "images/quests/rewards/ArgonCrystal.png",
        imgDescription: 'Три-девятое не за горами',
        description: `В этом мире порталы - это обыденность, но почти столь же и редкость.
                        Большинство из таковых соединяют два места этого мира, но есть и
                        иные, соединяющие этот мир с другими. Как раз-таки они и являются
                        наиболее важными, ибо могут быть как просто завораживающим местом,
                        так и представлять опасность, в основном, из-за обитателей мест на
                        другом входе. Однако эти порталы не появляются спонтанно, если быть
                        достаточно внимательным к потоку магии.`
    },

    {
        id: "q-research",
        difficulty: "hard",
        title: 'Изучение аномалий',
        rewardImg: "images/quests/rewards/ion_cube.png",
        imgDescription: 'Магическая энергия, которую прще использовать для технологий',
        description: `Как известно, в этом мире есть магия, а значит есть и мана,
                        необходимая для сотворения заклинаний, является неким неиссякаемым
                        источником энергии, ветающем вокруг. Однако не так давно было
                        обнаружено, что существует ещё более мощный источник энергии - эфир.
                        Хоть он и так же неисчерпаем, теоретически, но им не пропитано всё
                        пространство. В основном, он проявляется спонтанно в случайных
                        местах, концентрируясь в одном месте. На данный момент всё ещё не
                        известно зачем и почему происходят такие скопления эфира, ибо через
                        некоторое время, когда концентрация эфира достигает около 42%
                        относительно маны, эфирный "пузырь" лопается, разлетаясь на
                        внушительное расстояние, отчего все маги в области чувствуют
                        присутствие эфира. Нужно изучить эти проявления и, как минимум,
                        выдвинуть весомое предположение почему происходят такие скопления
                        эфира.`
    },

    {
        id: "q-help",
        difficulty: "easy",
        title: 'Помощь магией',
        rewardImg: "images/quests/rewards/riven_crystal.png",
        imgDescription: 'Осколок энерго-кристалла из иного мира за порталом',
        description: `Вооружение из обычных материалов, как например, сталь - армейский
                        стандарт. Но, как говорится: "нет предела совершенству", отчего
                        давно практикуется зачарование снаряжения магией. На сей же раз было
                        придумано новое вооружение, отчего требуется проявить креативность и
                        в магической части - подобрать оптимальные зачарования.`
    }
]